vermashobhit1994/Embedded-System-Software/IoT_Based_Health_Monitoring_System/stm32f44xx_driver_Layer1/Inc/stm32f44xx.h
/*
 * stm32f446xx.h
 *
 *  Created on: Jul 14, 2020
 *      Author: vermas
 */
/* Description : MCU Specific header file*/

#ifndef INC_STM32F446XX_H_
#define INC_STM32F446XX_H_

//To use NULL in SPI_TXE_Interrupt_Handle function .
#include<stddef.h>
#include<stdint.h>


/*volatile short notation*/
#define __vo volatile

 /*******************************SPECIAL NOTE: PROVIDE () WHILE SPECIFY BASE ADDRESS OF PERIPHERAL*****************/


/***************************************************************************************************************/
/*************************************** Processor Specific Details START *********************************************
 * For the ARM Cortex M4 NVIC ISRx Register i.e to enable the Interrupt.
 * Here each register is of 32 bit (4bytes) size and there are 8 such registers*/

/* NVIC ISER(Interrupt Set Enable Register) Base Addresses*/
#define NVIC_ISER0_BASE_ADDR                  ( (__vo uint32_t*)0xE000E100)
#define NVIC_ISER1_BASE_ADDR                  ( (__vo uint32_t*)0xE000E104)
#define NVIC_ISER2_BASE_ADDR                  ( (__vo uint32_t*)0xE000E108)
#define NVIC_ISER3_BASE_ADDR                  ( (__vo uint32_t*)0xE000E10C)
#define NVIC_ISER4_BASE_ADDR                  ( (__vo uint32_t*)0xE000E110)
#define NVIC_ISER5_BASE_ADDR                  ( (__vo uint32_t*)0xE000E114)
#define NVIC_ISER6_BASE_ADDR                  ( (__vo uint32_t*)0xE000E118)
#define NVIC_ISER7_BASE_ADDR                  ( (__vo uint32_t*)0xE000E11C)

/* NVIC ICER(Interrupt Clear Enable Register) Base Addresses*/
#define NVIC_ICER0_BASE_ADDR                  ( (__vo uint32_t*)0xE000E180)
#define NVIC_ICER1_BASE_ADDR                  ( (__vo uint32_t*)0xE000E184)
#define NVIC_ICER2_BASE_ADDR                  ( (__vo uint32_t*)0xE000E188)
#define NVIC_ICER3_BASE_ADDR                  ( (__vo uint32_t*)0xE000E18C)
#define NVIC_ICER4_BASE_ADDR                  ( (__vo uint32_t*)0xE000E190)
#define NVIC_ICER5_BASE_ADDR                  ( (__vo uint32_t*)0xE000E194)
#define NVIC_ICER6_BASE_ADDR                  ( (__vo uint32_t*)0xE000E198)
#define NVIC_ICER7_BASE_ADDR                  ( (__vo uint32_t*)0xE000E19C)

/* NVIC ICER(Interrupt Priority Register) Base Addresses*/
#define NVIC_PR_BASE_ADDR                     ( (__vo uint32_t*)0xE000E400)

/*Macro for the no of priority bits implemented for the Interrupt Priority Register
 * For the ARM Cortex M4 processor it is 4*/
#define NO_OF_PRIORITY_BITS_IMPLEMENTED         4

/* Macros for all possible IRQ Priority */
#define NVIC_IRQ_PRIO0                 0
#define NVIC_IRQ_PRIO1                 1
#define NVIC_IRQ_PRIO2                 2
#define NVIC_IRQ_PRIO3                 3
#define NVIC_IRQ_PRIO4                 4
#define NVIC_IRQ_PRIO5                 5
#define NVIC_IRQ_PRIO6                 6
#define NVIC_IRQ_PRIO7                 7
#define NVIC_IRQ_PRIO8                 8
#define NVIC_IRQ_PRIO9                 9
#define NVIC_IRQ_PRIO10                10
#define NVIC_IRQ_PRIO11                11
#define NVIC_IRQ_PRIO12                12
#define NVIC_IRQ_PRIO13                13
#define NVIC_IRQ_PRIO14                14
#define NVIC_IRQ_PRIO15                15
#define NVIC_IRQ_PRIO16                16
#define NVIC_IRQ_PRIO17                17
#define NVIC_IRQ_PRIO18                18
#define NVIC_IRQ_PRIO19                19
#define NVIC_IRQ_PRIO20                20
#define NVIC_IRQ_PRIO21                21
#define NVIC_IRQ_PRIO22                22
#define NVIC_IRQ_PRIO23                23
#define NVIC_IRQ_PRIO24                24
#define NVIC_IRQ_PRIO25                25
#define NVIC_IRQ_PRIO26                26
#define NVIC_IRQ_PRIO27                27
#define NVIC_IRQ_PRIO28                28
#define NVIC_IRQ_PRIO29                29
#define NVIC_IRQ_PRIO30                30
#define NVIC_IRQ_PRIO31                31


/***************************************************************************************************************/
/*************************************** Processor Specific Details ENDS *********************************************/



#include<stdint.h>//for uint32_t,uint16_t,uint8_t

/* defining the base address of FLASH and SRAM memory
**************************************************************************************************************/

#define FLASH_SECTOR_0_BASE_ADDR                 ( (uint32_t)0x08000000)   /*typecast to unsigned int*/
#define SRAM1_BASE_ADDR                 0x20000000U       //change the address to unsigned int
#define SRAM                            SRAM1_BASE_ADDR //define the SRAM1 as the main SRAM
#define SRAM2_BASE_ADDR                 0x2001C000U //base address of SRAM1 + size of the SRAM1
#define ROM_BASE_ADDR                   0x1FFF0000U//here the system memory is the ROM memory
#define OTP_AREA_BASE_ADDR              0x1FFF7800U//one time programmable area.Get from Flash memory details.

/*defining the base address of buses used*/
#define PERIPH_BASE_ADDR                (0x40000000U)//base address of the APB1 bus
#define APB1_PERIPH_BASE_ADDR           PERIPH_BASE_ADDR
#define APB2_PERIPH_BASE_ADDR           0x40010000U //base address of APB2  bus
#define AHB1_PERIPH_BASE_ADDR           0x40020000U//base address of AHB1 bus
#define AHB2_PERIPH_BASE_ADDR           0x50000000U//base address of AHB2 bus

  /* ******************* AHB1 bus peripherals base addresses***********************************************************
 * Base_ADDR_AHB1+offset(for the peripheral)*/
#define GPIOA_BASE_ADDR   (AHB1_PERIPH_BASE_ADDR+0x0000)
#define GPIOB_BASE_ADDR   (AHB1_PERIPH_BASE_ADDR+0x0400)
#define GPIOC_BASE_ADDR   (AHB1_PERIPH_BASE_ADDR+0x0800)
#define GPIOD_BASE_ADDR   (AHB1_PERIPH_BASE_ADDR+0x0C00)
#define GPIOE_BASE_ADDR   (AHB1_PERIPH_BASE_ADDR+0x1000)
#define GPIOF_BASE_ADDR   (AHB1_PERIPH_BASE_ADDR+0x1400)
#define GPIOG_BASE_ADDR   (AHB1_PERIPH_BASE_ADDR+0x1800)
#define GPIOH_BASE_ADDR   (AHB1_PERIPH_BASE_ADDR+0x1C00)
#define GPIOI_BASE_ADDR   (AHB1_PERIPH_BASE_ADDR+0x2000)

/* Base address for FLASH */
#define FLASH_BASE_ADDR   (AHB1_PERIPH_BASE_ADDR+0x3C00U)


