vermashobhit1994/Embedded-System-Software/IoT_Based_Health_Monitoring_System/stm32f44xx_driver_Layer1/Inc/stm32f44xx.h
//Base Address for the RCC Register
#define RCC_BASE_ADDR     (	AHB1_PERIPH_BASE_ADDR+0x3800)

/* ******************* APB1 bus peripherals base addresses*********************/
/*Defining the peripheral base address on the APB1 bus*/
#define I2C1_BASE_ADDR        (APB1_PERIPH_BASE_ADDR+0x5400U)
#define I2C2_BASE_ADDR        (APB1_PERIPH_BASE_ADDR+0x5800U)
#define I2C3_BASE_ADDR        (APB1_PERIPH_BASE_ADDR+0x5C00U)

#define USART2_BASE_ADDR      (APB1_PERIPH_BASE_ADDR+0x4400U)
#define USART3_BASE_ADDR      (APB1_PERIPH_BASE_ADDR+0x4800U)
#define UART4_BASE_ADDR       (APB1_PERIPH_BASE_ADDR+0x4C00U)
#define UART5_BASE_ADDR       (APB1_PERIPH_BASE_ADDR+0x5000U)

#define SPI2_BASE_ADDR        (APB1_PERIPH_BASE_ADDR+0x3800)
#define SPI3_BASE_ADDR        (APB1_PERIPH_BASE_ADDR+0x3C00)

/* used while configuring the SysClock*/
#define PWR_BASE_ADDR         (APB1_PERIPH_BASE_ADDR+0x7000U)

/* Used for delay */
#define TIM6_BASE_ADDR        (APB1_PERIPH_BASE_ADDR+0x1000U)


/*used for delay with interrupt*/
#define TIM7_BASE_ADDR        (APB1_PERIPH_BASE_ADDR + 0x1400U)

#define DAC_BASE_ADDR         (APB1_PERIPH_BASE_ADDR + 0x7400U)

/*peripheral base address on the APB2 bus*/

#define EXTI_BASE_ADDR        (APB2_PERIPH_BASE_ADDR+0x3C00)

#define SPI1_BASE_ADDR        (APB2_PERIPH_BASE_ADDR+0x3000)
#define SPI4_BASE_ADDR        (APB2_PERIPH_BASE_ADDR + 0x3400)

#define SYSCFG_BASE_ADDR      (APB2_PERIPH_BASE_ADDR+0x3800)

#define USART1_BASE_ADDR      (APB2_PERIPH_BASE_ADDR+0x1000U)
#define USART6_BASE_ADDR      (APB2_PERIPH_BASE_ADDR+0x1400U)

/*************************************************************************************************************/

/*Defining the peripheral specific register structure*/
/*Generic Register Definition Structure for GPIO's
 * Here the structure members helps in the offset.*/
/*************************************************************************************************************/
typedef struct
{
	__vo uint32_t MODER; //GPIO port mode register
	__vo uint32_t OTYPER;//GPIO port output type register
	__vo uint32_t OSPEEDR;//GPIO port output speed register
	__vo uint32_t PUPDR;//GPIO port pull-up/pull-down register
	__vo uint32_t IDR;//GPIO port input data register
	__vo uint32_t ODR;//GPIO port output data register
	__vo uint32_t BSRR;//GPIO port bit set/reset register
	__vo uint32_t LCKR;//GPIO port configuration lock register
	__vo uint32_t AFR[2];//AFR[0] -> for the alternate function low register and AFR[1] is for AFRH. GPIO Port configuration Alternate functionality register

}GPIO_RegDef_t;

/*Generic Register Definition Structure for RCC Peripheral
 * Here the RESERVED is written just for the offset due to reserved one*/
typedef struct
{
	__vo uint32_t      RCC_CR;
	__vo uint32_t      RCC_PLLCFGR;
	__vo uint32_t      RCC_CFGR;
	__vo uint32_t      RCC_CIR;
	__vo uint32_t      RCC_AHB1RSTR;
	__vo uint32_t      RCC_AHB2RSTR;
	__vo uint32_t      RCC_AHB3RSTR;
	 uint32_t          RESERVED;
	__vo uint32_t      RCC_APB1RSTR;
	__vo uint32_t      RCC_APB2RSTR;
	uint32_t           RESERVED2[2];//for two reserved values
	__vo uint32_t      RCC_AHB1ENR;
	__vo uint32_t      RCC_AHB2ENR;
	__vo uint32_t      RCC_AHB3ENR;
	 uint32_t          RESERVED1;
	__vo uint32_t      RCC_APB1ENR;
	__vo uint32_t      RCC_APB2ENR;
	uint32_t           RESERVED3[2];
	__vo uint32_t      RCC_AHB1LPENR;
	__vo uint32_t      RCC_AHB2LPENR;
	__vo uint32_t      RCC_AHB3LPENR;
	uint32_t           RESERVED4;
	__vo uint32_t      RCC_APB1LPENR;
	__vo uint32_t      RCC_APB2LPENR;
	uint32_t           RESERVED5[2];
	__vo uint32_t      RCC_BDCR;
	__vo uint32_t      RCC_CSR;
	uint32_t           RESERVED62[2];
	__vo uint32_t      RCC_SSCGR;
	__vo uint32_t      RCC_PLLI2SCFGR;
	__vo uint32_t      RCC_PLLSAICFGR;
	__vo uint32_t      RCC_DCKCFGR;
	__vo uint32_t      RCC_CKGATENR;
	__vo uint32_t      RCC_DCKCFGR2;

}RCC_RegDef_t;

/*Generic Register Definition Structure for EXTI Peripheral
 */
typedef struct
{
	__vo uint32_t               EXTI_IMR;/* Interrupt mask register. Address Offset = 0x00*/
	__vo uint32_t               EXTI_EMR;/* Event mask register . Address Offset = 0x04*/
	__vo uint32_t               EXTI_RTSR;/* Rising trigger selection register . Address Offset = 0x08*/
	__vo uint32_t               EXTI_FTSR;/* Falling trigger selection register . Address Offset = 0x0C*/
	__vo uint32_t               EXTI_SWIER;/* Software interrupt event register . Address Offset = 0x10*/
	__vo uint32_t               EXTI_PR;/* Pending register . Address Offset = 0x14*/

}EXTI_RegDef_t;

/* Generic Register Definition Structure for the SYSCFG Peripheral*/
typedef struct
{
	__vo uint32_t                SYSCFG_MEMRMP;/*SYSCFG memory remap register. Address Offset =0x00*/
	__vo uint32_t                SYSCFG_PMC;/*SYSCFG peripheral mode configuration register.Address Offset =0x04*/
	__vo uint32_t                SYSCFG_EXTICR[4];/*SYSCFG external interrupt configuration register 1-4.Address Offset =0x08 to 0x14*/
	     uint32_t                RESERVED1[2];
	__vo uint32_t                SYSCFG_CMPCR;/*Compensation cell control register. Address Offset =0x20*/
	     uint32_t                RESERVED2[2];
	__vo uint32_t                SYSCFG_CFGR;/*SYSCFG configuration register. Address Offset =0x2C*/
}SYSCFG_RegDef_t;

/* Generic Register Definition Structure for the SPI Peripheral*/
typedef struct
{
	__vo uint32_t                SPI_CR[2];/*SPI[0] for SPI Control Register1 ,Address Offset = 0x00 SPI[1] for SPI Control Register 2, Address Offset = 0x04 */
	__vo uint32_t                SPI_SR;/*SPI status register . Address Offset = 0x08 */
	__vo uint32_t                SPI_DR;/*SPI data register . Address Offset = 0x0C */
	__vo uint32_t                SPI_CRCPR;/* SPI CRC polynomial register. Address Offset = 0x10*/
	__vo uint32_t                SPI_RXCRCR;/* SPI RX CRC register. Address Offset = 0x14*/
	__vo uint32_t                SPI_TXCRCR;/* SPI TX CRC register. Address Offset = 0x18*/
	__vo uint32_t                SPI_I2SCFGR;/* SPI_I2S configuration register . Address Offset = 0x1C*/
	__vo uint32_t                SPI_I2SPR;/* SPI_I2S prescaler register. Address Offset = 0x20*/
}SPI_RegDef_t;

