vermashobhit1994/Embedded-System-Software/IoT_Based_Health_Monitoring_System/stm32f44xx_driver_Layer1/Inc/stm32f44xx.h
/* Generic Register Defination structure for the i2c Peripheral*/
typedef struct
{
	__vo uint32_t                I2C_CR[2];/* I2C_CR[0] for I2C Control Register 1, Address Offset = 0x00 and I2C_CR[1] for I2C Control Register 2, Address offset = 0x04*/
	__vo uint32_t                I2C_OAR[2];/* I2C_OAR[0] for I2C Own Address Register1 , Address offset = 0x08 and I2C_OAR[1] for I2C Own Address Register 2, Address offset = 0x0C*/
	__vo uint32_t                I2C_DR ; /* I2C Data Register , Address Offset = 0x10*/
	__vo uint32_t                I2C_SR[2];/* I2C_SR[0] for I2C Status Register1 , Address offset = 0x14 and I2C_SR[1] for I2C Status Register 2, Address offset = 0x18*/
	__vo uint32_t                I2C_CCR;/* I2C Clock Control Register , Address Offset = 0x1C*/
	__vo uint32_t                I2C_TRISE;/* I2C TRISE Register , Address Offset = 0x20*/
	__vo uint32_t                I2C_FLTR;/* I2C FLTR (filter) Register , Address Offset = 0x24*/

}I2C_RegDef_t;


/*Generic Register Defination Structure for USART Peripheral */
typedef struct
{
	__vo uint32_t   USART_SR;
	__vo uint32_t   USART_DR;
	__vo uint32_t   USART_BRR;
	__vo uint32_t   USART_CR1;
	__vo uint32_t   USART_CR2;
	__vo uint32_t   USART_CR3;
	__vo uint32_t   USART_GTPR;

}USART_RegDef_t;

/* Register Defination structure for Timer6 and Timer7*/
//timer6 or timer7 generic register defination
typedef struct
{
	__vo uint32_t     TIMx_CR1;
	__vo uint32_t     TIMx_CR2;
	     uint32_t     RESERVED1;
	__vo uint32_t     TIMx_DIER;
	__vo uint32_t     TIMx_SR;
	__vo uint32_t     TIMx_EGR;
	     uint32_t     RESERVED[3];
	__vo uint32_t     TIMx_CNT;
	__vo uint32_t     TIMx_PSC;
	__vo uint32_t     TIMx_ARR;

}TIMx_RegDef_t;

/* Register definition structure for Flash*/
typedef struct
{
	__vo uint32_t FLASH_ACR;
	__vo uint32_t FLASH_KEYR;
	__vo uint32_t FLASH_OPTKEYR;
	__vo uint32_t FLASH_SR;
	__vo uint32_t FLASH_CR;
	__vo uint32_t FLASH_OPTCR;

}FLASH_RegDef_t;

/* Register definition structure for Power controller */
typedef struct
{
	__vo uint32_t PWR_CR;
	__vo uint32_t PWR_CSR;

}PWR_RegDef_t;

/*Register definitions for DAC*/
typedef struct
{
	volatile uint32_t DAC_CR;
	volatile uint32_t DAC_SWTRIGR;
	volatile uint32_t DAC_DHR12R1;
	volatile uint32_t DAC_DHR12L1;
	volatile uint32_t DAC_DHR8R1;
	volatile uint32_t DAC_DHR12R2;
	volatile uint32_t DAC_DHR12L2;
	volatile uint32_t DAC_DHR8R2;
	volatile uint32_t DAC_DHR12RD;
	volatile uint32_t DAC_DHR12LD;
	volatile uint32_t DAC_DHR8RD;
	volatile uint32_t DAC_DOR1;
	volatile uint32_t DAC_DOR2;
	volatile uint32_t DAC_SR;
}DAC_RegDef_t;




/************************ Peripheral Register Definition Structure Ends ************************************************/
/************************************************************************************************************************/


/*Peripheral definitions macros i.e the peripheral base address typecast to stuct type for particular peripheral*/
/**************************************************************************************************************/

/* Here the GPIOx would store the base address of the peripheral and  is treated as pointer*/
#define GPIOA ((GPIO_RegDef_t*)GPIOA_BASE_ADDR)
#define GPIOB ((GPIO_RegDef_t*)GPIOB_BASE_ADDR)
#define GPIOC ((GPIO_RegDef_t*)GPIOC_BASE_ADDR)
#define GPIOD ((GPIO_RegDef_t*)GPIOD_BASE_ADDR)
#define GPIOE ((GPIO_RegDef_t*)GPIOE_BASE_ADDR)
#define GPIOF ((GPIO_RegDef_t*)GPIOF_BASE_ADDR)
#define GPIOG ((GPIO_RegDef_t*)GPIOG_BASE_ADDR)
#define GPIOH ((GPIO_RegDef_t*)GPIOH_BASE_ADDR)
#define GPIOI ((GPIO_RegDef_t*)GPIOI_BASE_ADDR)

/*Peripheral definitions for the RCC */
#define RCC  ((RCC_RegDef_t*)RCC_BASE_ADDR)

/*EXTI Peripheral definition */
#define EXTI  ((EXTI_RegDef_t*)EXTI_BASE_ADDR)

/*SYSCFG Peripheral Definition*/
#define SYSCFG   ((SYSCFG_RegDef_t*)SYSCFG_BASE_ADDR)

/*SPI Peripheral Definition Macros */
#define SPI1        ((SPI_RegDef_t*)SPI1_BASE_ADDR)
#define SPI2        ((SPI_RegDef_t*)SPI2_BASE_ADDR)
#define SPI3        ((SPI_RegDef_t*)SPI3_BASE_ADDR)
#define SPI4        ((SPI_RegDef_t*)SPI4_BASE_ADDR)

/* I2C Peripheral Definition Macros*/
#define I2C1       ((I2C_RegDef_t*)I2C1_BASE_ADDR)
#define I2C2       ((I2C_RegDef_t*)I2C2_BASE_ADDR)
#define I2C3       ((I2C_RegDef_t*)I2C3_BASE_ADDR)


/* USART Peripheral Defination Macros */
#define USART1      ((USART_RegDef_t*)USART1_BASE_ADDR)
#define USART2      ((USART_RegDef_t*)USART2_BASE_ADDR)
#define USART3      ((USART_RegDef_t*)USART3_BASE_ADDR)
#define UART4       ((USART_RegDef_t*)UART4_BASE_ADDR)
#define UART5       ((USART_RegDef_t*)UART5_BASE_ADDR)
#define USART6      ((USART_RegDef_t*)USART6_BASE_ADDR)

/* Timer6 peripheral base address pointer */
#define TIM6         ((TIMx_RegDef_t*)TIM6_BASE_ADDR)

/* Timer7 peripheral base address pointer */
#define TIM7         ((TIMx_RegDef_t*)TIM7_BASE_ADDR)

/* FLASH peripheral base address pointer*/
#define FLASH      ((FLASH_RegDef_t*)FLASH_BASE_ADDR)

/* PWR peripheral base address pointer*/
#define PWR        ((PWR_RegDef_t*)PWR_BASE_ADDR)

/* DAC peripheral Base address pointer*/
#define DAC         ( (DAC_RegDef_t*)DAC_BASE_ADDR)

/********************** Peripheral Definition Macros Ends **********************************************************/
/******************************************************************************************************************/

/*****************************************************************************************************************************/
/********************************************CLOCK ENABLING FOR PERIPHERALS***************************************************/


/*Clock Enable Macro for the GPIOx Peripheral*/
#define GPIOA_PERI_CLK_EN() (RCC -> RCC_AHB1ENR |= (1<<0))//High the 0th bit of the AHB1ENR of RCC to enable GPIOA clock.
#define GPIOB_PERI_CLK_EN() (RCC -> RCC_AHB1ENR |= (1<<1))//High the 1st bit of the AHB1ENR of RCC to enable GPIOB clock.
#define GPIOC_PERI_CLK_EN() (RCC -> RCC_AHB1ENR |= (1<<2))//High the 2nd bit of the AHB1ENR of RCC to enable GPIOC clock.
#define GPIOD_PERI_CLK_EN() (RCC -> RCC_AHB1ENR |= (1<<3))//High the 3rd bit of the AHB1ENR of RCC to enable GPIOD clock.
#define GPIOE_PERI_CLK_EN() (RCC -> RCC_AHB1ENR |= (1<<4))//High the 4th bit of the AHB1ENR of RCC to enable GPIOE clock.
#define GPIOF_PERI_CLK_EN() (RCC -> RCC_AHB1ENR |= (1<<5))//High the 5th bit of the AHB1ENR of RCC to enable GPIOF clock.
#define GPIOG_PERI_CLK_EN() (RCC -> RCC_AHB1ENR |= (1<<6))//High the 6th bit of the AHB1ENR of RCC to enable GPIOG clock.
#define GPIOH_PERI_CLK_EN() (RCC -> RCC_AHB1ENR |= (1<<7))//High the 7th bit of the AHB1ENR of RCC to enable GPIOH clock.
#define GPIOI_PERI_CLK_EN() (RCC -> RCC_AHB1ENR |= (1<<8))//High the 8th bit of the AHB1ENR of RCC to enable GPIOI clock.

