vermashobhit1994/Embedded-System-Software/IoT_Based_Health_Monitoring_System/stm32f44xx_driver_Layer1/Inc/stm32f44xx.h
//clock enable Macro for the I2Cx peripheral
//here I2Cx peripheral connected to APB1 bus
#define I2C1_PERI_CLK_EN()  (RCC -> RCC_APB1ENR |= (1<<21)) //high the 21st bit to enable I2C1
#define I2C2_PERI_CLK_EN()  (RCC -> RCC_APB1ENR |= (1<<22)) //high the 22nd bit to enable I2C2
#define I2C3_PERI_CLK_EN()  (RCC -> RCC_APB1ENR |= (1<<23)) //high the 23rd bit to enable I2C3

//clock enable Macro for the SPIx peripheral
#define SPI1_PERI_CLK_EN()  ( (RCC -> RCC_APB2ENR) |= (1<<12)) //high the 12th bit of RCC_APB2ENR to enable SPI1 Clock.
#define SPI2_PERI_CLK_EN()  (RCC -> RCC_APB1ENR |= (1<<14)) //high the 14th bit of RCC_APB1ENR to enable SPI2 Clock.
#define SPI3_PERI_CLK_EN()  (RCC -> RCC_APB1ENR |= (1<<15))//high the 15th bit of RCC_APB1ENR to enable SPI3 Clock.
#define SPI4_PERI_CLK_EN()  (RCC -> RCC_APB2ENR |= (1<<13))//high the 13th bit of RCC_APB2ENR to enable SPI4 Clock.

//clock enable Macro for the USARTx peripheral
#define USART1_PERI_CLK_EN()  (RCC -> RCC_APB2ENR |= (1<<4))//high the 4th bit of RCC_APB2ENR to enable USART1 Clock.
#define USART2_PERI_CLK_EN()  (RCC -> RCC_APB1ENR |= (1<<17))//high the 17th bit of RCC_APB1ENR to enable USART2 Clock.
#define USART3_PERI_CLK_EN()  (RCC -> RCC_APB1ENR |= (1<<18))//high the 18th bit of RCC_APB1ENR to enable USART3 Clock.
#define UART4_PERI_CLK_EN()  (RCC -> RCC_APB1ENR |= (1<<19))//high the 19th bit of RCC_APB1ENR to enable UART4 Clock.
#define UART5_PERI_CLK_EN()  (RCC -> RCC_APB1ENR |= (1<<20))//high the 20th bit of RCC_APB1ENR to enable UART5 Clock.
#define USART6_PERI_CLK_EN()  (RCC -> RCC_APB2ENR |= (1<<5))//high the 5th bit of RCC_APB2ENR to enable USART6 Clock.

//clock enable Macro for the SYSCFG peripheral
#define SYSCFG_PERI_CLK_EN() (RCC -> RCC_APB2ENR |= (1<<14))//high the 14th bit of RCC_APB2ENR to enable SYSCFG Clock.

//clock enable Macro for the TIMER6 Peripheral
#define TIM6_PERI_CLK_EN()    (RCC -> RCC_APB1ENR |= (1 << 4) )//high the 4th bit of RCC_APB1ENR to enable the TIM6 peripheral clock.

//clock enable Macro for the TIMER6 Peripheral
#define TIM7_PERI_CLK_EN()    (RCC -> RCC_APB1ENR |= (1 << 5) )//high the 5th bit of RCC_APB1ENR to enable the TIM7 peripheral clock.

//clock enable Macro for DAC
#define DAC_PERI_CLK_EN()     (RCC -> RCC_APB1ENR |= (1 << 29))

/*****************************************************************************************************************/

/*Clock Disable Macro for the GPIOx Peripheral*/
#define GPIOA_PERI_CLK_DI() (RCC -> RCC_AHB1ENR &= ~(1<<0))//Low the 0th bit of the AHB1ENR of RCC to disable GPIOA clock.
#define GPIOB_PERI_CLK_DI() (RCC -> RCC_AHB1ENR &= ~(1<<1))//Low the 1st bit of the AHB1ENR of RCC to disable GPIOB clock.
#define GPIOC_PERI_CLK_DI() (RCC -> RCC_AHB1ENR &= ~(1<<2))//Low the 2nd bit of the AHB1ENR of RCC to disable GPIOC clock.
#define GPIOD_PERI_CLK_DI() (RCC -> RCC_AHB1ENR &= ~(1<<3))//Low the 3rd bit of the AHB1ENR of RCC to disable GPIOD clock.
#define GPIOE_PERI_CLK_DI() (RCC -> RCC_AHB1ENR &= ~(1<<4))//Low the 4th bit of the AHB1ENR of RCC to disable GPIOE clock.
#define GPIOF_PERI_CLK_DI() (RCC -> RCC_AHB1ENR &= ~(1<<5))//Low the 5th bit of the AHB1ENR of RCC to disable GPIOF clock.
#define GPIOG_PERI_CLK_DI() (RCC -> RCC_AHB1ENR &= ~(1<<6))//Low the 6th bit of the AHB1ENR of RCC to disable GPIOG clock.
#define GPIOH_PERI_CLK_DI() (RCC -> RCC_AHB1ENR &= ~(1<<7))//Low the 7th bit of the AHB1ENR of RCC to disable GPIOH clock.
#define GPIOI_PERI_CLK_DI() (RCC -> RCC_AHB1ENR &= ~(1<<8))//Low the 8th bit of the AHB1ENR of RCC to disable GPIOI clock.

//clock Disable Macro for the I2Cx peripheral
//here I2Cx peripheral connected to APB1 bus
#define I2C1_PERI_CLK_DI()  (RCC -> RCC_APB1ENR &= ~(1<<21)) //Low the 21st bit to disable I2C1
#define I2C2_PERI_CLK_DI()  (RCC -> RCC_APB1ENR &= ~(1<<22)) //Low the 22nd bit to disable I2C2
#define I2C3_PERI_CLK_DI()  (RCC -> RCC_APB1ENR &= ~(1<<23)) //Low the 23rd bit to disable I2C3

//clock Disable Macro for the SPIx peripheral
#define SPI1_PERI_CLK_DI()  (RCC -> RCC_APB2ENR &= ~(1<<12)) //Low the 12th bit of RCC_APB2ENR to disable 12th bit
#define SPI2_PERI_CLK_DI()  (RCC -> RCC_APB1ENR &= ~(1<<14)) //Low the 14th bit of RCC_APB1ENR to disable 14th bit
#define SPI3_PERI_CLK_DI()  (RCC -> RCC_APB1ENR &= ~(1<<15))//Low the 15th bit of RCC_APB1ENR to disable 15th bit
#define SPI4_PERI_CLK_DI()  (RCC -> RCC_APB2ENR &= ~(1<<13))//Low the 13th bit of RCC_APB2ENR to disable 13th bit

//clock Disable Macro for the USARTx peripheral
#define USART1_PERI_CLK_DI()  (RCC -> RCC_APB2ENR &= ~(1<<4))
#define USART2_PERI_CLK_DI()  (RCC -> RCC_APB1ENR &= ~(1<<17))
#define USART3_PERI_CLK_DI()  (RCC -> RCC_APB1ENR &= ~(1<<18))
#define UART4_PERI_CLK_DI()  (RCC -> RCC_APB1ENR &= ~(1<<19))
#define UART5_PERI_CLK_DI()  (RCC -> RCC_APB1ENR &= ~(1<<20))
#define USART6_PERI_CLK_DI()  (RCC -> RCC_APB2ENR &= ~(1<<5))

//clock Disable Macro for the SYSCFG peripheral
#define SYSCFG_PERI_CLK_DI() (RCC -> RCC_APB2ENR &= ~(1<<14))

//Clock Disable Macro for DAC peripheral
#define DAC_PERI_CLK_DI()       (RCC ->RCC_APB1ENR &= ~( 1 << 29) )


/*macros to reset the GPIOx peripheral to their reset values
Here first we need to set the bit for corresponding peripheral then reset the bit
Here it is done by do while loop to include more than two statements in a single macro.
This do while loop is called as do while condition zero loop */
#define GPIOA_REG_RESET()    do { (RCC -> RCC_AHB1RSTR |= (1<<0)) ;  (RCC -> RCC_AHB1RSTR &= ~(1<<0));}while(0)
#define GPIOB_REG_RESET()    do { (RCC -> RCC_AHB1RSTR |= (1<<1)) ;  (RCC -> RCC_AHB1RSTR &= ~(1<<1));}while(0)
#define GPIOC_REG_RESET()    do { (RCC -> RCC_AHB1RSTR |= (1<<2)) ;  (RCC -> RCC_AHB1RSTR &= ~(1<<2));}while(0)
#define GPIOD_REG_RESET()    do { (RCC -> RCC_AHB1RSTR |= (1<<3)) ;  (RCC -> RCC_AHB1RSTR &= ~(1<<3));}while(0)
#define GPIOE_REG_RESET()    do { (RCC -> RCC_AHB1RSTR |= (1<<4)) ;  (RCC -> RCC_AHB1RSTR &= ~(1<<4));}while(0)
#define GPIOF_REG_RESET()    do { (RCC -> RCC_AHB1RSTR |= (1<<5)) ;  (RCC -> RCC_AHB1RSTR &= ~(1<<5));}while(0)
#define GPIOG_REG_RESET()    do { (RCC -> RCC_AHB1RSTR |= (1<<6)) ;  (RCC -> RCC_AHB1RSTR &= ~(1<<6));}while(0)
#define GPIOH_REG_RESET()    do { (RCC -> RCC_AHB1RSTR |= (1<<7)) ;  (RCC -> RCC_AHB1RSTR &= ~(1<<7));}while(0)
#define GPIOI_REG_RESET()    do { (RCC -> RCC_AHB1RSTR |= (1<<8)) ;  (RCC -> RCC_AHB1RSTR &= ~(1<<8));}while(0)


