vermashobhit1994/Embedded-System-Software/IoT_Based_Health_Monitoring_System/stm32f44xx_driver_Layer1/Inc/stm32f44xx.h
/* Macros to reset the SPI Peripheral to their Reset Values*
 *
 */
#define SPI1_REG_RESET()    do { (RCC -> RCC_APB2RSTR |= (1<<12)) ;  (RCC -> RCC_APB2RSTR &= ~(1<<12));}while(0)//set and clear the 12th bit of APB2RSTR
#define SPI2_REG_RESET()    do { (RCC -> RCC_APB1RSTR |= (1<<14)) ;  (RCC -> RCC_APB1RSTR &= ~(1<<14));}while(0)//set and clear the 14th bit of APB1RSTR
#define SPI3_REG_RESET()    do { (RCC -> RCC_APB1RSTR |= (1<<15)) ;  (RCC -> RCC_APB1RSTR &= ~(1<<15));}while(0)//set and clear the 15th bit of APB1RSTR
#define SPI4_REG_RESET()    do { (RCC -> RCC_APB2RSTR |= (1<<13)) ;  (RCC -> RCC_APB2RSTR &= ~(1<<13));}while(0)//set and clear the 13th bit of APB2RSTR

/* Macros to reset  the I2C Peripheral to their Reset Values
 */
#define I2C1_REG_RESET()    do { (RCC -> RCC_APB1RSTR |= (1<<21)); (RCC -> RCC_APB1RSTR &= ~(1<<21));}while(0)//set and clear the 21st bit of APB1RSTR
#define I2C2_REG_RESET()    do { (RCC -> RCC_APB1RSTR |= (1<<22)); (RCC -> RCC_APB1RSTR &= ~(1<<22));}while(0)//set and clear the 22th bit of APB1RSTR
#define I2C3_REG_RESET()    do { (RCC -> RCC_APB1RSTR |= (1<<23)); (RCC -> RCC_APB1RSTR &= ~(1<<23));}while(0)//set and clear the 22th bit of APB1RSTR

/* Macros to reset  the USART and UART Peripheral to their Reset Values
 */
#define USART1_REG_RESET()  do { (RCC -> RCC_APB2RSTR |= (1<<4)); (RCC -> RCC_APB2RSTR &= ~(1<<4));}while(0)//set and clear the 4th bit of APB1RSTR
#define USART2_REG_RESET()  do { (RCC -> RCC_APB1RSTR |= (1<<17)); (RCC -> RCC_APB1RSTR &= ~(1<<17));}while(0)//set and clear the 4th bit of APB1RSTR
#define USART3_REG_RESET()  do { (RCC -> RCC_APB1RSTR |= (1<<18)); (RCC -> RCC_APB1RSTR &= ~(1<<18));}while(0)//set and clear the 4th bit of APB1RSTR
#define UART4_REG_RESET()   do { (RCC -> RCC_APB1RSTR |= (1<<19)); (RCC -> RCC_APB1RSTR &= ~(1<<19));}while(0)//set and clear the 4th bit of APB1RSTR
#define UART5_REG_RESET()   do { (RCC -> RCC_APB1RSTR |= (1<<20)); (RCC -> RCC_APB1RSTR &= ~(1<<20));}while(0)//set and clear the 4th bit of APB1RSTR
#define USART6_REG_RESET()  do { (RCC -> RCC_APB2RSTR |= (1<<5)); (RCC -> RCC_APB2RSTR &= ~(1<<5));}while(0)//set and clear the 4th bit of APB1RSTR




/*Macro to select the Code to select the GPIO Port*/
#define GPIO_BASE_ADDR_TO_CODE(x)   ( (x == GPIOA) ? 0:\
		                              (x == GPIOB) ? 1:\
		                              (x == GPIOC) ? 2:\
		                              (x == GPIOD) ? 3:\
		                              (x == GPIOE) ? 4:\
		                              (x == GPIOF) ? 5:\
		                              (x == GPIOG) ? 6:0)


/* Macro for the IRQ(Interrupt Request ) numbers from the Vector Table*/
/* these are related to GPIO Ports */
#define IRQ_NO_EXTI0                   6
#define IRQ_NO_EXTI1                   7
#define IRQ_NO_EXTI2                   8
#define IRQ_NO_EXTI3                   9
#define IRQ_NO_EXTI4                   10
#define IRQ_NO_EXTI_9_5                23
#define IRQ_NO_EXTI_15_10              40
#define IRQ_NO_TIM7                    55
#define IRQ_NO_USART1                  37
#define IRQ_NO_USART2                  38
#define IRQ_NO_USART3                  39
#define IRQ_NO_UART4                   52
#define IRQ_NO_UART5                   53

/* Macro definations corresponding to SPI IRQ Numbers*/
/* This is taken from vector table */
#define IRQ_NO_SPI1                   35
#define IRQ_NO_SPI2                   36
#define IRQ_NO_SPI3                   51
#define IRQ_NO_SPI4                   84

/* Macro definations corresponding to I2C IRQ Numbers */
/* Taken from Vector Table*/
#define IRQ_NO_I2C1_EV                31
#define IRQ_NO_I2C1_ER                32
#define IRQ_NO_I2C2_EV                33
#define IRQ_NO_I2C2_ER                34
#define IRQ_NO_I2C3_EV                72
#define IRQ_NO_I2C3_ER                73






/*************************************************************************************************************
 * **********************************Some Generic Macros Used by driver header file***************************/
#define ENABLE                    1
#define DISABLE                   0
#define SET                       ENABLE
#define RESET                     DISABLE
#define GPIO_PIN_SET              SET
#define GPIO_PIN_RESET            RESET
#define SPI_FLAG_RESET            RESET        //macro used by SPI driver file to check the status whether data is there or not
#define SPI_FLAG_SET              SET          //macro used by SPI driver file to check the status whether data is there or not

/*************************************************************************************************************/

/*************************************************************************************************************/
/************************************* BIT Position Defination Macros For SPI Peripheral***********************/
/*************************************************************************************************************/

/* Macros for SPI_CR1 Register*/
#define SPI_CR1_CPHA                     0
#define SPI_CR1_CPOL                     1
#define SPI_CR1_MSTR                     2
#define SPI_CR1_BR                       3
#define SPI_CR1_SPE                      6
#define SPI_CR1_LSBFIRST                 7
#define SPI_CR1_SSI                      8
#define SPI_CR1_SSM                      9
#define SPI_CR1_RXONLY                   10
#define SPI_CR1_DFF                      11
#define SPI_CR1_CRCNEXT                  12
#define SPI_CR1_CRCEN                    13
#define SPI_CR1_BIDIOE                   14
#define SPI_CR1_BIDIMODE                 15

/* Macros for SPI_CR2 Register*/
#define SPI_CR2_RXDMAEN                  0
#define SPI_CR2_TXDMAEN                  1
#define SPI_CR2_SSOE                     2
#define SPI_CR2_FRF                      4
#define SPI_CR2_ERRIE                    5
#define SPI_CR2_RXNEIE                   6
#define SPI_CR2_TXEIE                    7

/* Macro for SPI_SR Register*/
#define SPI_SR_RXNE                      0
#define SPI_SR_TXE                       1
#define SPI_SR_CHSIDE                    2
#define SPI_SR_UDR                       3
#define SPI_SR_CRCERR                    4
#define SPI_SR_MODF                      5
#define SPI_SR_OVR                       6
#define SPI_SR_BSY                       7
#define SPI_SR_FRE                       8



/************************************* BIT Position Defination Macros for SPI ENDS ***********************/
/*************************************************************************************************************/

/*************************************************************************************************************/
/**********BIT Position Defination Macros for I2C START ***********************/

//For I2C Control Register 1
#define I2C_CR1_PE                   0
#define I2C_CR1_SMBUS                1
#define I2C_CR1_SMBTYPE              3
#define I2C_CR1_ENARP                4
#define I2C_CR1_ENPEC                5
#define I2C_CR1_ENGC                 6
#define I2C_CR1_NOSTRETCH            7
#define I2C_CR1_START                8
#define I2C_CR1_STOP                 9
#define I2C_CR1_ACK                  10
#define I2C_CR1_POS                  11
#define I2C_CR1_PEC                  12
#define I2C_CR1_ALERT                13
#define I2C_CR1_SWRST                15

//For I2C Control Register 2
#define I2C_CR2_FREQ                 0
#define I2C_CR2_ITERREN              8
#define I2C_CR2_ITEVTEN              9
#define I2C_CR2_ITBUFEN              10
#define I2C_CR2_DMAEN                11
#define I2C_CR2_LAST                 12

//For I2C status Register 1
#define I2C_SR1_SB                    0
#define I2C_SR1_ADDR                  1
#define I2C_SR1_BTF                   2
#define I2C_SR1_ADD10                 3
#define I2C_SR1_STOPF                 4
#define I2C_SR1_RXNE                  6
#define I2C_SR1_TXE                   7
#define I2C_SR1_BERR                  8
#define I2C_SR1_ARLO                  9
#define I2C_SR1_AF                    10
#define I2C_SR1_OVR                   11
#define I2C_SR1_PECERR                12
#define I2C_SR1_TIMEOUT               14
#define I2C_SR1_SMBALERT              15

