vermashobhit1994/Embedded-System-Software/IoT_Based_Health_Monitoring_System/stm32f44xx_driver_Layer1/Inc/stm32f44xx.h
//For I2C status Register 2
#define I2C_SR2_MSL                   0
#define I2C_SR2_BUSY                  1
#define I2C_SR2_TRA                   2
#define I2C_SR2_GENCALL               4
#define I2C_SR2_SMBDEFAULT            5
#define I2C_SR2_SMBHOST               6
#define I2C_SR2_DUALF                 7
#define I2C_SR2_PEC                   8

//For I2C Clock Control Register
#define I2C_CCR_CCR                   0
#define I2C_CCR_DUTY                  14
#define I2C_CCR_F_S                   15


/************************************* BIT Position Defination Macros for I2C ENDS ***********************/
/*************************************************************************************************************/


/*************************************************************************************************************/
/**********BIT Position Defination Macros for USART/UART START***********************/

//for SR Register
#define USART_SR_PE            0
#define USART_SR_FE            1
#define USART_SR_NF            2
#define USART_SR_ORE           3
#define USART_SR_IDLE          4
#define USART_SR_RXNE          5
#define USART_SR_TC            6
#define USART_SR_TXE           7
#define USART_SR_LBD           8
#define USART_SR_CTS           9


//Bit Position Definition Macros For USART_CR1 Register
#define USART_CR1_SBK          0
#define USART_CR1_RWU          1
#define USART_CR1_RE           2
#define USART_CR1_TE           3
#define USART_CR1_IDLEIE       4
#define USART_CR1_RXNEIE       5
#define USART_CR1_TCIE         6
#define USART_CR1_TXEIE        7
#define USART_CR1_PEIE         8
#define USART_CR1_PS           9
#define USART_CR1_PCE          10
#define USART_CR1_WAKE         11
#define USART_CR1_M            12
#define USART_CR1_UE           13
#define USART_CR1_OVR8         15


//for CR2 Register
#define USART_CR2_LBDL         5
#define USART_CR2_LBDIE        6
#define USART_CR2_LBCL         8
#define USART_CR2_CPHA         9
#define USART_CR2_CPOL         10
#define USART_CR2_CLKEN        11
#define USART_CR2_STOP         12
#define USART_CR2_LINEN        14

//for CR3 Register
#define USART_CR3_EIE           0
#define USART_CR3_IREN          1
#define USART_CR3_IRLP          2
#define USART_CR3_HDSEL         3
#define USART_CR3_NACK          4
#define USART_CR3_SCEN          5
#define USART_CR3_DMAR          6
#define USART_CR3_DMAT          7
#define USART_CR3_RTSE          8
#define USART_CR3_CTSE          9
#define USART_CR3_CTSIE         10
#define USART_CR3_ONEBIT        11


/* Peripheral Register bit macros for USART_BRR Register*/
#define USART_BRR_DIV_FRACTION          0
#define USART_BRR_DIV_MANTISSA          4

/* RCC BDCR Macros corresponding to bits */
#define RCC_BDCR_LSEON          0
#define RCC_BDCR_LSERDY         1
#define RCC_BDCR_LSEBYP         2
#define RCC_BDCR_LSEMOD         3
#define RCC_BDCR_RTCSEL         8
#define RCC_BDCR_RTCEN          15
#define RCC_BDCR_BDRST          16

/* Bit definitions macros */
#define RCC_AHB1ENR_GPIOA_EN         0
#define RCC_AHB1ENR_GPIOB_EN         1
#define RCC_AHB1ENR_GPIOC_EN         2
#define RCC_AHB1ENR_GPIOD_EN         3
#define RCC_AHB1ENR_GPIOE_EN         4
#define RCC_AHB1ENR_GPIOF_EN         5
#define RCC_AHB1ENR_GPIOG_EN         6
#define RCC_AHB1ENR_GPIOH_EN         7
#define RCC_AHB1ENR_CRC_EN           12
#define RCC_AHB1ENR_BKPSRAM_EN       18
#define RCC_AHB1ENR_DMA1_EN          21
#define RCC_AHB1ENR_DMA2_EN          22
#define RCC_AHB1ENR_OTGHS_EN         29
#define RCC_AHB1ENR_OTGHSULPI_EN     30

/* Register Bit definition macros corresponding to RCC_APB1ENR Register */
#define RCC_APB1ENR_TIM6_EN          4
#define RCC_APB1ENR_TIM7_EN          5
#define RCC_APB1ENR_PWR_EN           28

/* Register Bit definition macros corresponding to RCC_PLLCFGR Register */
#define RCC_PLLCFGR_PLLM             0
#define RCC_PLLCFGR_PLLN             6
#define RCC_PLLCFGR_PLLP             16
#define RCC_PLLCFGR_PLLSRC           22
#define RCC_PLLCFGR_PLLQ             24
#define RCC_PLLCFGR_PLLR             28






/* Register Bit definition macros corresponding to RCC_CFGR Register */
#define RCC_CFGR_SW                  0
#define RCC_CFGR_SWS                 2
#define RCC_CFGR_HPRE                4
#define RCC_CFGR_PPRE1               10
#define RCC_CFGR_PPRE2               13


/* macro corresponding to apb1 prescaler clock division*/
#define RCC_AHB1_CLK_DIV1()          ( RCC -> RCC_CFGR &= ~(0x7U << RCC_CFGR_PPRE1) )
#define RCC_AHB1_CLK_DIV2()          ( RCC -> RCC_CFGR |= (0x4U << RCC_CFGR_PPRE1) )
#define RCC_AHB1_CLK_DIV4()          ( RCC -> RCC_CFGR |= (0x5U << RCC_CFGR_PPRE1) )
#define RCC_AHB1_CLK_DIV8()          ( RCC -> RCC_CFGR |= (0x6U << RCC_CFGR_PPRE1) )
#define RCC_AHB1_CLK_DIV16()         ( RCC -> RCC_CFGR |= (0x7U << RCC_CFGR_PPRE1) )


/* Flag bits for RCC CFGR SWS bits */
#define RCC_CFGR_SWS_HSI               0
#define RCC_CFGR_SWS_HSE               1
#define RCC_CFGR_SWS_PLL               2
#define RCC_CFGR_SWS_PLLR              3


/* Register Bit definition macros corresponding to RCC_CR Register */
#define RCC_CR_HSION                0
#define RCC_CR_HSIRDY               1
#define RCC_CR_HSEON                16
#define RCC_CR_HSERDY               17
#define RCC_CR_HSEBYP               18
#define RCC_CR_PLLON                24
#define RCC_CR_PLLRDY               25


#define TIMx_SR_UIF                  0

#define TIMx_CR1_CEN                 0
#define TIMx_CR1_URS                 2

#define TIMx_DIER_UIE                0

#define PWR_CR_VOS                   14

/* Register Bit definition macros corresponding to RCC_CR Register */
#define FLASH_ACR_LATENCY            0
#define FLASH_ACR_PRFTEN             8
#define FLASH_ACR_ICEN               9
#define FLASH_ACR_DCEN               10
#define FLASH_ACR_ICRST              11
#define FLASH_ACR_DCRST              12

/*************************************************************************************************************/

//#include"stm32f44xx_gpio_driver.h"//gpio device specific header file
//#include"stm32f44xx_i2c_driver.h"//i2c device specific header file
//#include"stm32f44xx_spi_driver.h"//spi device specific header file
//#include"stm32f44xx_usart_driver.h"//usart and uart both device specific header file
//#include"stm32f44xx_rtc_driver.h"




#endif /* INC_STM32F446XX_H_ */
